<script>
    import { user } from '../stores.js'
</script>

<style>
    .introduction {
        max-width: 600px;
    }

    small {
        display: block;
        margin-left: 2em;
        color: #3d6c24;
    }
</style>

<article class="introduction">
    <p>
        Скорее всего ты видишь этот текст, потому что заходишь в первый раз
        (если нет — сообщи @mt об этом!)
        <small>Да, эта социальная сеть разговаривает с тобой на ты.</small>
    </p>

    <p>
        Поэтому я могу немного рассказать о том, что здесь происходит.
        <small>«Я» здесь это @mt, а не я, социальная сеть.</small>
    </p>

    <p>
        Это небольшая социальная сеть! Можно писать посты, можно читать посты.
        <small>
            Вода мокрая, небо серое, мог бы что интересное рассказать.
        </small>
    </p>

    <p>
        Чтобы видеть посты, нужно подписаться на людей (или подписаться на
        шляпы!) Например:
        <a href="/u/mt" rel="prefetch">@mt</a>
        ,
        <a href="/u/bedniy_kotik">@bedniy_kotik</a>
        .
        <small>Не забудь подписаться на котов.</small>
    </p>

    <p>
        Шляпы — это псевдонимы, и если тебе выдали, скажем, шляпу @bedniy_kotik,
        то ты можешь подписаться как @{$user.username}, так и как @bedniy_kotik.
        <small>
            В общем, попробуй, не бойся меня сломать, если что-то
            случилось&nbsp;—&nbsp;пиши&nbsp;
            <a href="/u/mt">@mt</a>
        </small>
    </p>
</article>
